## [목차]
### 데이터 분석 프로세스
- 데이터 수집, 저장소, 정리
- (선택) 분석용 데이터 분석, 정제(결측치), 라벨링, 증강
- (전처리) 전처리 데이터, 마이닝, 시각화, 특징 추출
- (변환) 데이터 변환, Train/Test set
- (AI모델) 모델
- 활용
### 1. 데이터 정제
  - Data Cleansing - 정제1 : 결측치 처리 (결측치 포함여부, 발생원인 파악, 비율 확인, 처리하기)
  - Data Cleansing - 정제2 : 이상치 처리 (이상치 포함여부(백분위수), 발생원인 파악, 처리방법 결정(삭제/대체), 처리하기)
### 2. 데이터 변환
  - 통합 : 조인(기준_key을 두고 합치기) / 병합(이어 붙이기)
  - 변환 : 파생변수/원핫인코딩, 정렬(소팅), 피봇테이블, 행렬전환, 행 변경 등
    - groupby : 열을 기준으로 묶어서 agg 연산
    - pivot table : 행과 열 기준으로 그룹화하여 연산, 통계화
  - 스케일러(Scaler)
    - Standard Scaler
    - Min-Max Scaler
    - Robust Scaler
  - 축소 : 제거, 대체, 중복값, 상관관계 기반 중복속성 판단
  - df.duplicated() → df.drop_duplicates(inplace=True)
  - Redundant attributes
    - 상관도 : 상관계수(Correlation coefficient), 공분산, 피어슨 상관계수
### 3. 시계열 데이터 전처리
- 시계열 데이터 : 시간 순서로 배열된 데이터
- N * M * Z (배치 * 행 * 열)
- 슬라이딩 윈도우 : 예측타겟에 사용할 데이터의 묶음 생성
- 결측치를 버리거나 선형 보간법 처리

## 데이터 전처리 연습

**`pd.read_csv`를 이용하여 titanic 데이터를 로드합니다.**

In [25]:
data=pd.read_csv('./titanic_train.csv')

**data의 상위 5개 row를 확인합니다.**

In [26]:
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

**각 컬럼의 Null 갯수를 확인합니다.**

In [27]:
data.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [28]:
data.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [31]:
# 빈 나이를 채우고 싶은데 어떻게 채울것이냐?

**`Age`의 max, min, mean 값을 확인합니다.**

In [32]:
print(f"{data['Age'].max()}")
print(f"{data['Age'].min()}")
print(f"{data['Age'].mean()}")

80.0
0.42
29.69911764705882

**`Name` 컬럼에서 initial 부분만 가져와 `data`의 `Initial`컬럼에 저장합니다.**

In [36]:
data.Name.str.extract('Harris')  # capture groups → 정규표현식 : 괄호 형태로 표현

ValueError: pattern contains no capture groups

In [37]:
data.Name.str.extract('(Harris)')

          0
0    Harris
1       NaN
2       NaN
3       NaN
4       NaN
..      ...
886     NaN
887     NaN
888     NaN
889     NaN
890     NaN

[891 rows x 1 columns]

In [39]:
data.Name.str.extract('([A-Za-z]+)\.')  # 이니셜을 모으자 . 앞에 단어들로

        0
0      Mr
1     Mrs
2    Miss
3     Mrs
4      Mr
..    ...
886   Rev
887  Miss
888  Miss
889    Mr
890    Mr

[891 rows x 1 columns]

In [33]:
data['Initial']=0

for i in data:
    data['Initial']=data.Name.str.extract('([A-Za-z]+)\.')  # 정규표현식 이해에 대한 공부가 좀 필요함
    
data['Initial']

0        Mr
1       Mrs
2      Miss
3       Mrs
4        Mr
       ...
886     Rev
887    Miss
888    Miss
889      Mr
890      Mr
Name: Initial, Length: 891, dtype: object

#### 정규표현식
- 괄호 안은 group 이다
- 대괄호 안에 있는 것들 : A-Za-z 영어문자 아무거나
- '+' : 한 개 이상 붙어있는 영어문자 골라
- '\.' : 마침표 → 그냥 . 이면 문자 한 개를 뜻하기 때문에 마침표라는 의미를 가지려면 '\.'

In [41]:
# 정규표현식
# 괄호 안은 group 이다
# 대괄호 안에 있는 것들 : A-Za-z 영어문자 아무거나
# + : 한 개 이상 붙어있는 영어문자 골라
# \. : 마침표 → 그냥 . 이면 문자 한 개를 뜻하기 때문에 마침표라는 의미를 가지려면 '\.'

**Sex 별 Initial 수를 확인합니다.**

`pd.crosstab`을 이용하여 `data.Initial`, `data.Sex` 의 교차표를 구합니다.

In [42]:
pd.crosstab(data.Initial, data.Sex).T

Initial,Capt,Col,Countess,Don,Dr,Jonkheer,Lady,Major,Master,Miss,Mlle,Mme,Mr,Mrs,Ms,Rev,Sir
Sex,,,,,,,,,,,,,,,,,
female,0,0,1,0,1,0,1,0,0,182,2,1,0,125,1,0,0
male,1,2,0,1,6,1,0,2,40,0,0,0,517,0,0,6,1

In [43]:
pd.crosstab(data.Sex, data.Initial)

Initial,Capt,Col,Countess,Don,Dr,Jonkheer,Lady,Major,Master,Miss,Mlle,Mme,Mr,Mrs,Ms,Rev,Sir
Sex,,,,,,,,,,,,,,,,,
female,0,0,1,0,1,0,1,0,0,182,2,1,0,125,1,0,0
male,1,2,0,1,6,1,0,2,40,0,0,0,517,0,0,6,1

**`Initial`의 철자가 틀린 것들을 올바르게 변환합니다.**

In [44]:
data['Initial'].replace(
    ['Mlle','Mme','Ms','Dr','Major','Lady','Countess','Jonkheer','Col','Rev','Capt','Sir','Don'],  # 바꾸고자 하는 것들
    ['Miss','Miss','Miss','Mr','Mr','Mrs','Mrs','Other','Other','Other','Mr','Mr','Mr'],  # 각각 대응되어서 바꿀 것들
    inplace=True
    )

In [49]:
pd.crosstab(data.Sex, data.Initial)

Initial  Master  Miss   Mr  Mrs  Other
Sex
female        0   186    1  127      0
male         40     0  528    0      9

In [50]:
# 주어진 이름으로부터 이니셜 뽑아내고 사용될 형태로 재가공 수행

In [51]:
data

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Initial
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,Mr
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,Mrs
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,Miss
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,Mrs
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,Mr
...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S,Other
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S,Miss
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S,Miss
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C,Mr
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q,Mr

**[TODO] `Initial`별로 `Age`의 평균을 출력합니다.**

In [56]:
data.groupby('Initial').apply(lambda x: print(x))

     PassengerId  Survived  Pclass  \
7              8         0       3
16            17         0       3
50            51         0       3
59            60         0       3
63            64         0       3
65            66         1       3
78            79         1       2
125          126         1       3
159          160         0       3
164          165         0       3
165          166         1       3
171          172         0       3
176          177         0       3
182          183         0       3
183          184         1       2
193          194         1       2
261          262         1       3
278          279         0       3
305          306         1       1
340          341         1       2
348          349         1       3
386          387         0       3
407          408         1       2
445          446         1       1
480          481         0       3
489          490         1       3
549          550         1       2
709          710         1       3
751          752         1       3
755          756         1       2
787          788         0       3
788          789         1       3
802          803         1       1
803          804         1       3
819          820         0       3
824          825         0       3
827          828         1       2
831          832         1       2
850          851         0       3
869          870         1       3

                                                  Name   Sex    Age  SibSp  \
7                       Palsson, Master. Gosta Leonard  male   2.00      3
16                                Rice, Master. Eugene  male   2.00      4
50                          Panula, Master. Juha Niilo  male   7.00      4
59                  Goodwin, Master. William Frederick  male  11.00      5
63                               Skoog, Master. Harald  male   4.00      3
65                            Moubarek, Master. Gerios  male    NaN      1
78                       Caldwell, Master. Alden Gates  male   0.83      0
125                       Nicola-Yarred, Master. Elias  male  12.00      1
159                         Sage, Master. Thomas Henry  male    NaN      8
164                       Panula, Master. Eino Viljami  male   1.00      4
165    Goldsmith, Master. Frank John William "Frankie"  male   9.00      0
171                               Rice, Master. Arthur  male   4.00      4
176                      Lefebre, Master. Henry Forbes  male    NaN      3
182              Asplund, Master. Clarence Gustaf Hugo  male   9.00      4
183                          Becker, Master. Richard F  male   1.00      2
193                         Navratil, Master. Michel M  male   3.00      1
261                  Asplund, Master. Edvin Rojj Felix  male   3.00      4
278                                 Rice, Master. Eric  male   7.00      4
305                     Allison, Master. Hudson Trevor  male   0.92      1
340                     Navratil, Master. Edmond Roger  male   2.00      1
348             Coutts, Master. William Loch "William"  male   3.00      1
386                    Goodwin, Master. Sidney Leonard  male   1.00      5
407                     Richards, Master. William Rowe  male   3.00      1
445                          Dodge, Master. Washington  male   4.00      0
480                     Goodwin, Master. Harold Victor  male   9.00      5
489              Coutts, Master. Eden Leslie "Neville"  male   9.00      1
549                     Davies, Master. John Morgan Jr  male   8.00      1
709  Moubarek, Master. Halim Gonios ("William George")  male    NaN      1
751                                Moor, Master. Meier  male   6.00      0
755                          Hamalainen, Master. Viljo  male   0.67      1
787                          Rice, Master. George Hugh  male   8.00      4
788                         Dean, Master. Bertram Vere  male   1.00      1
802                Carter, Master. William Thornton II  male  11.00      1
803                    Thomas, Master. Assad Alexander  male   0.42      0
819                       Skoog, Master. Karl Thorsten  male  10.00      3
824                       Panula, Master. Urho Abraham  male   2.00      4
827                              Mallet, Master. Andre  male   1.00      0
831                    Richards, Master. George Sibley  male   0.83      1
850            Andersson, Master. Sigvard Harald Elias  male   4.00      4
869                    Johnson, Master. Harold Theodor  male   4.00      1

     Parch           Ticket      Fare    Cabin Embarked Initial
7        1           349909   21.0750      NaN        S  Master
16       1           382652   29.1250      NaN        Q  Master
50       1          3101295   39.6875      NaN        S  Master
59       2          CA 2144   46.9000      NaN        S  Master
63       2           347088   27.9000      NaN        S  Master
65       1             2661   15.2458      NaN        C  Master
78       2           248738   29.0000      NaN        S  Master
125      0             2651   11.2417      NaN        C  Master
159      2         CA. 2343   69.5500      NaN        S  Master
164      1          3101295   39.6875      NaN        S  Master
165      2           363291   20.5250      NaN        S  Master
171      1           382652   29.1250      NaN        Q  Master
176      1             4133   25.4667      NaN        S  Master
182      2           347077   31.3875      NaN        S  Master
183      1           230136   39.0000       F4        S  Master
193      1           230080   26.0000       F2        S  Master
261      2           347077   31.3875      NaN        S  Master
278      1           382652   29.1250      NaN        Q  Master
305      2           113781  151.5500  C22 C26        S  Master
340      1           230080   26.0000       F2        S  Master
348      1       C.A. 37671   15.9000      NaN        S  Master
386      2          CA 2144   46.9000      NaN        S  Master
407      1            29106   18.7500      NaN        S  Master
445      2            33638   81.8583      A34        S  Master
480      2          CA 2144   46.9000      NaN        S  Master
489      1       C.A. 37671   15.9000      NaN        S  Master
549      1       C.A. 33112   36.7500      NaN        S  Master
709      1             2661   15.2458      NaN        C  Master
751      1           392096   12.4750     E121        S  Master
755      1           250649   14.5000      NaN        S  Master
787      1           382652   29.1250      NaN        Q  Master
788      2        C.A. 2315   20.5750      NaN        S  Master
802      2           113760  120.0000  B96 B98        S  Master
803      1             2625    8.5167      NaN        C  Master
819      2           347088   27.9000      NaN        S  Master
824      1          3101295   39.6875      NaN        S  Master
827      2  S.C./PARIS 2079   37.0042      NaN        C  Master
831      1            29106   18.7500      NaN        S  Master
850      2           347082   31.2750      NaN        S  Master
869      1           347742   11.1333      NaN        S  Master
     PassengerId  Survived  Pclass                                      Name  \
2              3         1       3                    Heikkinen, Miss. Laina
10            11         1       3           Sandstrom, Miss. Marguerite Rut
11            12         1       1                  Bonnell, Miss. Elizabeth
14            15         0       3      Vestrom, Miss. Hulda Amanda Adolfina
22            23         1       3               McGowan, Miss. Anna "Annie"
..           ...       ...     ...                                       ...
866          867         1       2              Duran y More, Miss. Asuncion
875          876         1       3          Najib, Miss. Adele Kiamie "Jane"
882          883         0       3              Dahlberg, Miss. Gerda Ulrika
887          888         1       1              Graham, Miss. Margaret Edith
888          889         0       3  Johnston, Miss. Catherine Helen "Carrie"

        Sex   Age  SibSp  Parch            Ticket     Fare Cabin Embarked  \
2    female  26.0      0      0  STON/O2. 3101282   7.9250   NaN        S
10   female   4.0      1      1           PP 9549  16.7000    G6        S
11   female  58.0      0      0            113783  26.5500  C103        S
14   female  14.0      0      0            350406   7.8542   NaN        S
22   female  15.0      0      0            330923   8.0292   NaN        Q
..      ...   ...    ...    ...               ...      ...   ...      ...
866  female  27.0      1      0     SC/PARIS 2149  13.8583   NaN        C
875  female  15.0      0      0              2667   7.2250   NaN        C
882  female  22.0      0      0              7552  10.5167   NaN        S
887  female  19.0      0      0            112053  30.0000   B42        S
888  female   NaN      1      2        W./C. 6607  23.4500   NaN        S

    Initial
2      Miss
10     Miss
11     Miss
14     Miss
22     Miss
..      ...
866    Miss
875    Miss
882    Miss
887    Miss
888    Miss

[186 rows x 13 columns]
     PassengerId  Survived  Pclass                            Name   Sex  \
0              1         0       3         Braund, Mr. Owen Harris  male
4              5         0       3        Allen, Mr. William Henry  male
5              6         0       3                Moran, Mr. James  male
6              7         0       1         McCarthy, Mr. Timothy J  male
12            13         0       3  Saundercock, Mr. William Henry  male
..           ...       ...     ...                             ...   ...
881          882         0       3              Markun, Mr. Johann  male
883          884         0       2   Banfield, Mr. Frederick James  male
884          885         0       3          Sutehall, Mr. Henry Jr  male
889          890         1       1           Behr, Mr. Karl Howell  male
890          891         0       3             Dooley, Mr. Patrick  male

      Age  SibSp  Parch            Ticket     Fare Cabin Embarked Initial
0    22.0      1      0         A/5 21171   7.2500   NaN        S      Mr
4    35.0      0      0            373450   8.0500   NaN        S      Mr
5     NaN      0      0            330877   8.4583   NaN        Q      Mr
6    54.0      0      0             17463  51.8625   E46        S      Mr
12   20.0      0      0         A/5. 2151   8.0500   NaN        S      Mr
..    ...    ...    ...               ...      ...   ...      ...     ...
881  33.0      0      0            349257   7.8958   NaN        S      Mr
883  28.0      0      0  C.A./SOTON 34068  10.5000   NaN        S      Mr
884  25.0      0      0   SOTON/OQ 392076   7.0500   NaN        S      Mr
889  26.0      0      0            111369  30.0000  C148        C      Mr
890  32.0      0      0            370376   7.7500   NaN        Q      Mr

[529 rows x 13 columns]
     PassengerId  Survived  Pclass  \
1              2         1       1
3              4         1       1
8              9         1       3
9             10         1       2
15            16         1       2
..           ...       ...     ...
871          872         1       1
874          875         1       2
879          880         1       1
880          881         1       2
885          886         0       3

                                                  Name     Sex   Age  SibSp  \
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
8    Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)  female  27.0      0
9                  Nasser, Mrs. Nicholas (Adele Achem)  female  14.0      1
15                    Hewlett, Mrs. (Mary D Kingcome)   female  55.0      0
..                                                 ...     ...   ...    ...
871   Beckwith, Mrs. Richard Leonard (Sallie Monypeny)  female  47.0      1
874              Abelson, Mrs. Samuel (Hannah Wizosky)  female  28.0      1
879      Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)  female  56.0      0
880       Shelley, Mrs. William (Imanita Parrish Hall)  female  25.0      0
885               Rice, Mrs. William (Margaret Norton)  female  39.0      0

     Parch     Ticket     Fare Cabin Embarked Initial
1        0   PC 17599  71.2833   C85        C     Mrs
3        0     113803  53.1000  C123        S     Mrs
8        2     347742  11.1333   NaN        S     Mrs
9        0     237736  30.0708   NaN        C     Mrs
15       0     248706  16.0000   NaN        S     Mrs
..     ...        ...      ...   ...      ...     ...
871      1      11751  52.5542   D35        S     Mrs
874      0  P/PP 3381  24.0000   NaN        C     Mrs
879      1      11767  83.1583   C50        C     Mrs
880      1     230433  26.0000   NaN        S     Mrs
885      5     382652  29.1250   NaN        Q     Mrs

[127 rows x 13 columns]
     PassengerId  Survived  Pclass                                 Name   Sex  \
149          150         0       2    Byles, Rev. Thomas Roussel Davids  male
150          151         0       2           Bateman, Rev. Robert James  male
249          250         0       2        Carter, Rev. Ernest Courtenay  male
626          627         0       2       Kirkland, Rev. Charles Leonard  male
647          648         1       1  Simonius-Blumer, Col. Oberst Alfons  male
694          695         0       1                      Weir, Col. John  male
822          823         0       1      Reuchlin, Jonkheer. John George  male
848          849         0       2                    Harper, Rev. John  male
886          887         0       2                Montvila, Rev. Juozas  male

      Age  SibSp  Parch       Ticket    Fare Cabin Embarked Initial
149  42.0      0      0       244310  13.000   NaN        S   Other
150  51.0      0      0  S.O.P. 1166  12.525   NaN        S   Other
249  54.0      1      0       244252  26.000   NaN        S   Other
626  57.0      0      0       219533  12.350   NaN        Q   Other
647  56.0      0      0        13213  35.500   A26        C   Other
694  60.0      0      0       113800  26.550   NaN        S   Other
822  38.0      0      0        19972   0.000   NaN        S   Other
848  28.0      0      1       248727  33.000   NaN        S   Other
886  27.0      0      0       211536  13.000   NaN        S   Other

Empty DataFrame
Columns: []
Index: []

In [58]:
data.groupby('Initial')['Age'].agg('mean')

Initial
Master     4.574167
Miss      21.860000
Mr        32.739609
Mrs       35.981818
Other     45.888889
Name: Age, dtype: float64

**[TODO] `Age`가 null인 경우 `Initials`별로 `Age`의 평균을 참고하여 값을 채웁니다.**

In [59]:
data.loc[(data.Age.isnull()) & (data.Initial == 'Master'), 'Age'] = 5  # & 교집합, | 합집합
data.loc[(data.Age.isnull()) & (data.Initial == 'Miss'), 'Age'] = 22  # 나이니까 반올림
data.loc[(data.Age.isnull()) & (data.Initial == 'Mr'), 'Age'] = 33
data.loc[(data.Age.isnull()) & (data.Initial == 'Mrs'), 'Age'] = 36
data.loc[(data.Age.isnull()) & (data.Initial == 'Other'), 'Age'] = 46

**[TODO] `Age`에 null 값이 있는지 확인합니다.**

In [60]:
data.Age.isnull().any()

False

In [61]:
data.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age              0
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
Initial          0
dtype: int64

가족 구성원의 수를 담은 컬럼을 추가합니다.

In [62]:
data['FamilySize'] = data.SibSp + data.Parch + 1

혼자 탑승했는지에 대한 유무를 담은 컬럼을 추가합니다.

In [63]:
data['IsAlone'] = 1 
data['IsAlone'].loc[data['FamilySize'] > 1] = 0

C:\Users\king5\AppData\Local\Temp\ipykernel_4904\1316621672.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  data['IsAlone'].loc[data['FamilySize'] > 1] = 0

In [64]:
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Initial,FamilySize,IsAlone
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,Mr,2,0
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,Mrs,2,0
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,Miss,1,1
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,Mrs,2,0
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,Mr,1,1

텍스트 데이터이지만 카테고리컬 한 의미를 가진 컬럼들을 정수형으로 변환한다.

In [65]:
label = LabelEncoder()  # 수치형으로 일단 바꿔놓고, 뒤에서 원 핫 인코딩 할 때 쓰기 쉽도록 변환해준다

data['Sex_Code'] = label.fit_transform(data['Sex'])
data['Embarked_Code'] = label.fit_transform(data['Embarked'])
data['Initial_Code'] = label.fit_transform(data['Initial'])

In [66]:
data

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Initial,FamilySize,IsAlone,Sex_Code,Embarked_Code,Initial_Code
0,1,0,3,"Braund, Mr. Owen Harris",male,22.00,1,0,A/5 21171,7.2500,NaN,S,Mr,2,0,1,2,2
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.00,1,0,PC 17599,71.2833,C85,C,Mrs,2,0,0,0,3
2,3,1,3,"Heikkinen, Miss. Laina",female,26.00,0,0,STON/O2. 3101282,7.9250,NaN,S,Miss,1,1,0,2,1
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.00,1,0,113803,53.1000,C123,S,Mrs,2,0,0,2,3
4,5,0,3,"Allen, Mr. William Henry",male,35.00,0,0,373450,8.0500,NaN,S,Mr,1,1,1,2,2
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.00,0,0,211536,13.0000,NaN,S,Other,1,1,1,2,4
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.00,0,0,112053,30.0000,B42,S,Miss,1,1,0,2,1
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,21.86,1,2,W./C. 6607,23.4500,NaN,S,Miss,4,0,0,2,1
889,890,1,1,"Behr, Mr. Karl Howell",male,26.00,0,0,111369,30.0000,C148,C,Mr,1,1,1,0,2
890,891,0,3,"Dooley, Mr. Patrick",male,32.00,0,0,370376,7.7500,NaN,Q,Mr,1,1,1,1,2